<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of TurningPointCloud. Make sure you are licensed for this product before using this. This is adapted from com.github.andrewvalentine.munki.TurningPoint recipes for the non cloud version of TurningPoint</string>
	<key>Identifier</key>
	<string>com.github.samtarr.download.TurningPointCloud</string>
	<key>Input</key>
	<dict>
		<key>APPNAME</key>
		<string>%NAME%</string>
		<key>NAME</key>
		<string>TurningPointCloud</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://s3.amazonaws.com/com.turningtech.download.production/turningpoint-cloud/TurningPointCloud.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
